In [1]:
import pandas as pd

### Key Data Structure in Pandas
* Series (1 dimensional)
* Data Frame (2 dimensional)

In [4]:
s = pd.Series([1,2,3,4,5], index=['a','b','c','d','e']) #by Defualt index are 1,2,3,4...

In [5]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
df = pd.DataFrame({"names": ["Talha", "Rashid", "Alex", "Jhon"], "marks":[80, 72, 63, 91] })
df

    names  marks
0   Talha     80
1  Rashid     72
2    Alex     63
3    Jhon     91